[
{"http_status_header": "100 Continue", "description": "This interim response indicates that everything so far is OK and that the client should continue the request, or ignore the response if the request is already finished."},
{"http_status_header": "101 Switching Protocol", "description": "This code is sent in response to an "},
{"http_status_header": "102 Processing", "description": " request header from the client, and indicates the protocol the server is switching to."},
{"http_status_header": "103 Early Hints", "description": "This code indicates that the server has received and is processing the request, but no response is available yet."},
{"http_status_header": "200 OK", "description": "This status code is primarily intended to be used with the "},
{"http_status_header": "201 Created", "description": " header, letting the user agent start "},
{"http_status_header": "202 Accepted", "description": " resources while the server prepares a response."},
{"http_status_header": "203 Non-Authoritative Information", "description": "The request has succeeded. The meaning of the success depends on the HTTP method:\n\t"},
{"http_status_header": "204 No Content", "description": "\n\t"},
{"http_status_header": "205 Reset Content", "description": "The request has succeeded and a new resource has been created as a result. This is typically the response sent after "},
{"http_status_header": "206 Partial Content", "description": " requests, or some "},
{"http_status_header": "207 Multi-Status", "description": " requests."},
{"http_status_header": "208 Already Reported", "description": "The request has been received but not yet acted upon. It is noncommittal, since there is no way in HTTP to later send an asynchronous response indicating the outcome of the request. It is intended for cases where another process or server handles the request, or for batch processing."},
{"http_status_header": "226 IM Used", "description": "This response code means the returned meta-information is not exactly the same as is available from the origin server, but is collected from a local or a third-party copy. This is mostly used for mirrors or backups of another resource. Except for that specific case, the \"200 OK\" response is preferred to this status."},
{"http_status_header": "300 Multiple Choice", "description": "There is no content to send for this request, but the headers may be useful. The user-agent may update its cached headers for this resource with the new ones."},
{"http_status_header": "301 Moved Permanently", "description": "Tells the user-agent to reset the document which sent this request."},
{"http_status_header": "302 Found", "description": "This response code is used when the "},
{"http_status_header": "303 See Other", "description": " header is sent from the client to request only part of a resource."},
{"http_status_header": "304 Not Modified", "description": "Conveys information about multiple resources, for situations where multiple status codes might be appropriate."},
{"http_status_header": "307 Temporary Redirect", "description": "Used inside a "},
{"http_status_header": "308 Permanent Redirect", "description": " response element to avoid repeatedly enumerating the internal members of multiple bindings to the same collection."},
{"http_status_header": "400 Bad Request", "description": "The server has fulfilled a "},
{"http_status_header": "401 Unauthorized", "description": " request for the resource, and the response is a representation of the result of one or more instance-manipulations applied to the current instance."},
{"http_status_header": "402 Payment Required", "description": "The request has more than one possible response. The user-agent or user should choose one of them. (There is no standardized way of choosing one of the responses, but HTML links to the possibilities are recommended so the user can pick.)"},
{"http_status_header": "403 Forbidden", "description": "The URL of the requested resource has been changed permanently. The new URL is given in the response."},
{"http_status_header": "404 Not Found", "description": "This response code means that the URI of requested resource has been changed "},
{"http_status_header": "405 Method Not Allowed", "description": ". Further changes in the URI might be made in the future. Therefore, this same URI should be used by the client in future requests."},
{"http_status_header": "406 Not Acceptable", "description": "The server sent this response to direct the client to get the requested resource at another URI with a GET request."},
{"http_status_header": "407 Proxy Authentication Required", "description": "This is used for caching purposes. It tells the client that the response has not been modified, so the client can continue to use the same cached version of the response."},
{"http_status_header": "408 Request Timeout", "description": "Defined in a previous version of the HTTP specification to indicate that a requested response must be accessed by a proxy. It has been deprecated due to security concerns regarding in-band configuration of a proxy."},
{"http_status_header": "409 Conflict", "description": "This response code is no longer used; it is just reserved. It was used in a previous version of the HTTP/1.1 specification."},
{"http_status_header": "410 Gone", "description": "The server sends this response to direct the client to get the requested resource at another URI with same method that was used in the prior request. This has the same semantics as the "},
{"http_status_header": "411 Length Required", "description": " HTTP response code, with the exception that the user agent "},
{"http_status_header": "412 Precondition Failed", "description": " change the HTTP method used: If a "},
{"http_status_header": "413 Payload Too Large", "description": " was used in the first request, a "},
{"http_status_header": "414 URI Too Long", "description": " must be used in the second request."},
{"http_status_header": "415 Unsupported Media Type", "description": "This means that the resource is now permanently located at another URI, specified by the "},
{"http_status_header": "416 Range Not Satisfiable", "description": " HTTP Response header. This has the same semantics as the "},
{"http_status_header": "417 Expectation Failed", "description": " HTTP response code, with the exception that the user agent "},
{"http_status_header": "418 I'm a teapot", "description": " change the HTTP method used: If a "},
{"http_status_header": "421 Misdirected Request", "description": " was used in the first request, a "},
{"http_status_header": "422 Unprocessable Entity", "description": " must be used in the second request."},
{"http_status_header": "423 Locked", "description": "The server could not understand the request due to invalid syntax."},
{"http_status_header": "424 Failed Dependency", "description": "Although the HTTP standard specifies \"unauthorized\", semantically this response means \"unauthenticated\". That is, the client must authenticate itself to get the requested response."},
{"http_status_header": "425 Too Early", "description": "This response code is reserved for future use. The initial aim for creating this code was using it for digital payment systems, however this status code is used very rarely and no standard convention exists."},
{"http_status_header": "426 Upgrade Required", "description": "The client does not have access rights to the content; that is, it is unauthorized, so the server is refusing to give the requested resource. Unlike 401, the client's identity is known to the server."},
{"http_status_header": "428 Precondition Required", "description": "The server can not find the requested resource. In the browser, this means the URL is not recognized. In an API, this can also mean that the endpoint is valid but the resource itself does not exist. Servers may also send this response instead of 403 to hide the existence of a resource from an unauthorized client. This response code is probably the most famous one due to its frequent occurrence on the web."},
{"http_status_header": "429 Too Many Requests", "description": "The request method is known by the server but has been disabled and cannot be used. For example, an API may forbid DELETE-ing a resource. The two mandatory methods, "},
{"http_status_header": "431 Request Header Fields Too Large", "description": " and "},
{"http_status_header": "451 Unavailable For Legal Reasons", "description": ", must never be disabled and should not return this error code."},
{"http_status_header": "500 Internal Server Error", "description": "This response is sent when the web server, after performing "},
{"http_status_header": "501 Not Implemented", "description": ", doesn't find any content that conforms to the criteria given by the user agent."},
{"http_status_header": "502 Bad Gateway", "description": "This is similar to 401 but authentication is needed to be done by a proxy."},
{"http_status_header": "503 Service Unavailable", "description": "This response is sent on an idle connection by some servers, even without any previous request by the client. It means that the server would like to shut down this unused connection. This response is used much more since some browsers, like Chrome, Firefox 27+, or IE9, use HTTP pre-connection mechanisms to speed up surfing. Also note that some servers merely shut down the connection without sending this message."},
{"http_status_header": "504 Gateway Timeout", "description": "This response is sent when a request conflicts with the current state of the server."},
{"http_status_header": "505 HTTP Version Not Supported", "description": "This response is sent when the requested content has been permanently deleted from server, with no forwarding address. Clients are expected to remove their caches and links to the resource. The HTTP specification intends this status code to be used for \"limited-time, promotional services\". APIs should not feel compelled to indicate resources that have been deleted with this status code."},
{"http_status_header": "506 Variant Also Negotiates", "description": "Server rejected the request because the "},
{"http_status_header": "507 Insufficient Storage", "description": " header field is not defined and the server requires it."},
{"http_status_header": "508 Loop Detected", "description": "The client has indicated preconditions in its headers which the server does not meet."},
{"http_status_header": "510 Not Extended", "description": "Request entity is larger than limits defined by server; the server might close the connection or return an "},
{"http_status_header": "511 Network Authentication Required", "description": " header field."}
]